{
  "HomePage": {
    "aboutProjectTitle": "О проекте",
    "aboutProjectDescr": "Наше приложение — простой REST-клиент, вдохновлённый такими инструментами как Postman. Оно позволяет отправлять HTTP-запросы к любым открытым RESTful API, просматривать ответы и управлять историей запросов. Приложение поддерживает разные HTTP-методы, заголовки и тела запросов, а также генерирует соответствующие фрагменты кода на нескольких языках программирования. Проект создан с использованием Next.js, React и TypeScript, стилизован с помощью TailwindCSS и shadcn/ui, и следует современным практикам разработки с ESLint, Prettier, Husky и Jest для тестирования.",
    "aboutCourceTitle": "О курсе",
    "aboutCourceDescr": "Этот проект является частью курса RS School по ReactJS, который обучает созданию реальных приложений на React с TypeScript, современными фреймворками, тестированием и лучшими практиками фронтенд-разработки."
  },
  "Team": {
    "teamTitle": "Наша команда",
    "teamSubtitle": "Познакомьтесь с нами",
    "teamMemberFirst": {
      "name": "Маргарита Шишковец",
      "bio": "Маргарита Шишкавец — начинающий frontend-разработчик с хорошим чувством деталей и страстью к созданию чистых, адаптивных интерфейсов. В течение последнего года она изучала веб-разработку, сосредоточившись на верстке, стилизации и создании удобных для пользователя дизайнов. Она любит работать в команде, ценит открытое общение и считает, что совместная работа помогает ей раскрывать свой потенциал."
    },
    "teamMemberSecond": {
      "name": "Елена Павлович",
      "bio": "Елена Павлович — начинающий frontend-разработчик с вниманием к деталям и страстью к созданию чистых, адаптивных пользовательских интерфейсов. В течение последнего года она погружалась в веб-разработку, сосредоточившись на верстке, стилизации и создании интуитивно понятных, удобных дизайнов. Она отлично работает в коллективе, ценит открытое общение и считает, что командная работа вдохновляет на достижение лучших результатов."
    },
    "teamMemberThird": {
      "name": "Юлия Налецкая",
      "bio": "Юлия Налецкая — начинающий frontend-разработчик, которая недавно перешла в IT после прохождения курса веб-дизайна в 2024 году и курса frontend-разработки в RS School в 2025 году. Её увлекает процесс создания современных веб-приложений и интуитивно понятных пользовательских интерфейсов. Она увлечена постоянным обучением, принимает быстро развивающуюся природу frontend-разработки и любит применять новые технологии для создания актуальных решений."
    }
  },
  "Buttons": {
    "signIn": "Войти",
    "signUp": "Зарегистрироваться"
  },
  "Form": {
    "formTitle": "Добро пожаловать в REST Client"
  },
  "NotFoundPage": {
    "mainMessage": "К сожалению, такой страницы не существует",
    "back": "На главную"
  }
}
